.doom.d/README.org
#+TITLE:    Emacs Configuration
#+PROPERTY: header-args :tangle config.el
#+DATE:    January 21, 2021
#+SINCE:   <replace with next tagged release version>
#+STARTUP: inlineimages nofold

* TABLE OF CONTENTS :toc:
- [[#doom-emacs-configuration-information][Doom Emacs Configuration Information]]
- [[#email-and-user-information][Email And User Information]]
- [[#font-settings][Font Settings]]
- [[#theme-settings][Theme Settings]]
- [[#splits][Splits]]
- [[#file-directory-and-backup-settings][File, Directory And Backup Settings]]
- [[#org-mode-settings][Org Mode Settings]]
- [[#cursor-and-line-settings][Cursor And Line Settings]]
- [[#package-settings][Package Settings]]
  - [[#neotree][Neotree]]
  - [[#eww-browser][Eww Browser]]
  - [[#dired-file-explorer][Dired File Explorer]]
  - [[#elfeed][ELFEED]]
  - [[#emms][EMMS]]
  - [[#ivy][Ivy]]
  - [[#mastodon][Mastodon]]
- [[#mu4e][MU4E]]
  - [[#setting-up-environment-with-main-account][Setting Up Environment With Main Account]]
  - [[#setting-up-multiple-accounts][Setting up Multiple Accounts]]
  - [[#function-to-facilitate-switching-between-accounts][Function To Facilitate Switching Between Accounts]]
- [[#evaluate-elisp-expressions][Evaluate Elisp Expressions]]
- [[#additional-information-useful-functions-and-macros-etc][Additional Information, Useful Functions And Macros, Etc.]]
  - [[#registers][Registers]]
  - [[#useful-functions][Useful Functions]]

* Doom Emacs Configuration Information
Remember you don't need to run doom sync after you make changes to this file.
It will load on its own automatically when you save the file.

* Email And User Information

#+begin_src elisp
(setq user-full-name "Scotty Copa"
      user-mail-address "CopaDott@gmail.com")
#+end_src

* Font Settings

#+begin_src elisp
(setq doom-font (font-spec :family "Hack Nerd Font" :size 13 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "Hack Nerd Font Mono" :size 13)
      doom-big-font (font-spec :family "Hack Nerd Font" :size 26))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

* Theme Settings

#+begin_src elisp
(setq doom-theme 'doom-one)
(map! :leader
      :desc "Load new theme"
      "h t" #'counsel-load-theme)
#+end_src

* Splits
I set splits to default to opening on the right using ‘prefer-horizontal-split’. I set a keybinding for ‘clone-indirect-buffer-other-window’ for when I want to have the same document in two splits. The text of the indirect buffer is always identical to the text of its base buffer; changes made by editing either one are visible immediately in the other. But in all other respects, the indirect buffer and its base buffer are completely separate. For example, I can fold one split but other will be unfolded.

#+begin_src elisp
(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; make this as low as needed
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
(map! :leader
      :desc "Clone indirect buffer other window"
      "b c" #'clone-indirect-buffer-other-window)
#+end_src

* File, Directory And Backup Settings
Org directory must be set before org mode loads, so if you want to change the default then you'll need to restart Emacs.

#+begin_src elisp
(setq auto-save-default t)                      ;; Turns on auto-save
(setq auto-save-interval 200)                   ;; Defines character limit before autosaving
(setq backup-by-copying t)                      ;; Prevents clobbering of symlinks
(setq delete-old-versions t)                    ;; Deletes older versions
(setq kept-new-versions 6)                      ;; Defines what's considered new
(setq kept-old-versions 2)                      ;; Defines where it starts deleting.
(setq version-control t)                        ;; Use versioned backups
(setq make-backup-files t)                      ;; Makes backup files
#+end_src

* Org Mode Settings

#+begin_src elisp
(after! org
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  (setq org-directory "~/org/"
        org-agenda-files '("~/org/agenda.org")
        org-default-notes-file (expand-file-name "notes.org" org-directory)
        org-ellipsis " ▼ "
        org-log-done 'time
        org-journal-dir "~/org/journal/"
        org-journal-date-format "%B %d, %Y (%A) "
        org-journal-file-format "%Y-%m-%d.org"
        org-hide-emphasis-markers t
        ;; ex. of org-link-abbrev-alist in action
        ;; [[arch-wiki:Name_of_Page][Description]]
        org-link-abbrev-alist    ; This overwrites the default Doom org-link-abbrev-list
          '(("google" . "http://www.google.com/search?q=")
            ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
            ("ddg" . "https://duckduckgo.com/?q=")
            ("wiki" . "https://en.wikipedia.org/wiki/"))
        org-todo-keywords        ; This overwrites the default Doom org-todo-keywords
          '((sequence
             "TODO(t)"           ; A task that is ready to be tackled
             "BLOG(b)"           ; Blog writing assignments
             "GYM(g)"            ; Things to accomplish at the gym
             "PROJ(p)"           ; A project that contains other tasks
             "VIDEO(v)"          ; Video assignments
             "WAIT(w)"           ; Something is holding up this task
             "|"                 ; The pipe necessary to separate "active" states and "inactive" states
             "DONE(d)"           ; Task has been completed
             "CANCELLED(c)" )))) ; Task has been cancelled

#+end_src

* Cursor And Line Settings

#+begin_src elisp
(setq display-line-numbers-type t)              ;; Line numbers. nil = disabled, t = on, relative = relative numbers.
(map! :leader
      :desc "Toggle truncate lines"
      "t t" #'toggle-truncate-lines)

(setq undo-limit 80000000)                      ;; raise undo limit to 80Mb

(display-time-mode 1)                           ;; display time in the mode-line
#+end_src

* Package Settings


** Neotree
File tree viewer.

#+begin_src elisp
(after! neotree
  (setq neo-smart-open t
        neo-window-fixed-size nil))
(after! doom-themes
  (setq doom-neotree-enable-variable-pitch t))
(map! :leader
      :desc "Toggle neotree file viewer"
      "t n" #'neotree-toggle
      :leader
      :desc "Open directory in neotree"
      "d n" #'neotree-dir)
#+end_src

** Eww Browser

#+begin_src elisp
(setq browse-url-browser-function 'eww-browse-url)
(map! :leader
      :desc "Eww web browser"
      "e w" #'eww
      :leader
      :desc "Eww reload page"
      "e R" #'eww-reload
      :leader
      :desc "Search web for text between BEG/END"
      "s w" #'eww-search-words)
#+end_src

** Dired File Explorer
#+begin_src elisp
(map! :leader
      :desc "Dired"
      "d d" #'dired
      :leader
      :desc "Dired jump to current"
      "d j" #'dired-jump
      (:after dired
        (:map dired-mode-map
         :leader
         :desc "Peep-dired image previews"
         "d p" #'peep-dired
         :leader
         :desc "Dired view file"
         "d v" #'dired-view-file)))
;; Make 'h' and 'l' go back and forward in dired. Much faster to navigate the directory structure!
(evil-define-key 'normal dired-mode-map
  (kbd "h") 'dired-up-directory
  (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
;; If peep-dired is enabled, you will get image previews as you go up/down with 'j' and 'k'
(evil-define-key 'normal peep-dired-mode-map
  (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
;; Get file icons in dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "sxiv")
                              ("jpg" . "sxiv")
                              ("png" . "sxiv")
                              ("mkv" . "vlc")
                              ("mp4" . "vlc")))
#+end_src

** ELFEED
Emacs RSS news feed reader.
#+begin_src elisp
(custom-set-variables
 '(elfeed-feeds
   (quote
    (("https://www.reddit.com/r/linux.rss" reddit linux)
     ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
     ("https://hackaday.com/blog/feed/" hackaday linux)
     ("https://opensource.com/feed" opensource linux)
     ("https://linux.softpedia.com/backend.xml" softpedia linux)
     ("https://itsfoss.com/feed/" itsfoss linux)
     ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
     ("https://www.phoronix.com/rss.php" phoronix linux)
     ("http://feeds.feedburner.com/d0od" omgubuntu linux)
     ("https://www.computerworld.com/index.rss" computerworld linux)
     ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
     ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
     ("https://betanews.com/feed" betanews linux)
     ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
     ("https://distrowatch.com/news/dwd.xml" distrowatch linux)))))
#+end_src

