.doom.d/README.org
** EMMS
Emacs multimedia player
#+begin_src elisp
(emms-all)
(emms-default-players)
(emms-mode-line 1)
(emms-playing-time 1)
(setq emms-source-file-default-directory "~/Music/Non-Classical/70s-80s/"
      emms-playlist-buffer-name "*Music*"
      emms-info-asynchronously t
      emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
(map! :leader
      :desc "Go to emms playlist"
      "a a" #'emms-playlist-mode-go
      :leader
      :desc "Emms pause track"
      "a x" #'emms-pause
      :leader
      :desc "Emms stop track"
      "a s" #'emms-stop
      :leader
      :desc "Emms play previous track"
      "a p" #'emms-previous
      :leader
      :desc "Emms play next track"
      "a n" #'emms-next)
#+end_src

** Ivy
*** Ivy-POSFRAME
Ivy-posframe is an ivy extension, which lets ivy use posframe to show its candidate menu. Some of the settings below involve:

    ivy-posframe-display-functions-alist – sets the display position for specific programs
    ivy-posframe-height-alist – sets the height of the list displayed for specific programs

Available functions (positions) for ‘ivy-posframe-display-functions-alist’

    ivy-posframe-display-at-frame-center
    ivy-posframe-display-at-window-center
    ivy-posframe-display-at-frame-bottom-left
    ivy-posframe-display-at-window-bottom-left
    ivy-posframe-display-at-frame-bottom-window-center
    ivy-posframe-display-at-point
    ivy-posframe-display-at-frame-top-center

NOTE: If the setting for ‘ivy-posframe-display’ is set to ‘nil’ (false), anything that is set to ‘ivy-display-function-fallback’ will just default to their normal position in Doom Emacs (usually a bottom split). However, if this is set to ‘t’ (true), then the fallback position will be centered in the window.

#+begin_src elisp
(setq ivy-posframe-display-functions-alist
      '((swiper                     . ivy-posframe-display-at-point)
        (complete-symbol            . ivy-posframe-display-at-point)
        (counsel-M-x                . ivy-display-function-fallback)
        (counsel-esh-history        . ivy-posframe-display-at-window-center)
        (counsel-describe-function  . ivy-display-function-fallback)
        (counsel-describe-variable  . ivy-display-function-fallback)
        (counsel-find-file          . ivy-display-function-fallback)
        (counsel-recentf            . ivy-display-function-fallback)
        (counsel-register           . ivy-posframe-display-at-frame-bottom-window-center)
        (dmenu                      . ivy-posframe-display-at-frame-top-center)
        (nil                        . ivy-posframe-display))
      ivy-posframe-height-alist
      '((swiper . 20)
        (dmenu . 20)
        (t . 10)))
(ivy-posframe-mode 1) ; 1 enables posframe-mode, 0 disables it.
#+end_src

*** Ivy Keybindings
By default Doom Emacs doesn't use 'SPC v', so the format I use for these bindings is 'SPC v' plus 'key'

#+begin_src elisp
(map! :leader
      :desc "Ivy push view"
      "v p" #'ivy-push-view
      :leader
      :desc "Ivy switch view"
      "v s" #'ivy-switch-view)
#+end_src

** Mastodon
Mastodon.el is a Mastodon client for Emacs. Note that I wrapped my settings with (after! mastodon). Without this my settings for the Mastodon instance that I use would be overwritten by the default settings for this module, which is "Mastodon.social".

#+begin_src elisp
(after! mastodon
  (setq mastodon-instance-url "https://distrotoot.com/"))
#+end_src

* MU4E
Setting up mu4e, which is an email client that works within emacs. You must install mu4e and mbsync through your linux distrobution's package manager. Setting up smtp for sending mail. Make sure the gnutls command line utils are installed. Package 'gnutls-bin' in Debian/Ubuntu and 'gnutls' in Arch.

** Setting Up Environment With Main Account
I will be setting up mu4e to use three different email addresses. This source block contains default settings and fallback settings.
*** TODO Turn on MU4E and turn this into code block
#+begin_src elisp
;;(add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu4e")
;;(require 'smtpmail)
;;(setq user-mail-address "derek@distrotube.com"
;;      user-full-name  "Derek Taylor"
      ;; I have my mbsyncrc in a different folder on my system, to keep it separate from the
      ;; mbsyncrc available publicly in my dotfiles. You MUST edit the following line.
      ;; Be sure that the following command is: "mbsync -c ~/.config/mu4e/mbsyncrc -a"
;;      mu4e-get-mail-command "mbsync -c ~/.config/mu4e-dt/mbsyncrc -a"
;;      mu4e-update-interval  300
;;      mu4e-main-buffer-hide-personal-addresses t
;;      message-send-mail-function 'smtpmail-send-it
;;      starttls-use-gnutls t
;;      smtpmail-starttls-credentials '(("smtp.1and1.com" 587 nil nil))
;;      mu4e-sent-folder "/account-1/Sent"
;;      mu4e-drafts-folder "/account-1/Drafts"
;;      mu4e-trash-folder "/account-1/Trash"
;;      mu4e-maildir-shortcuts
;;      '(("/account-1/Inbox"      . ?i)
;;        ("/account-1/Sent Items" . ?s)
;;        ("/account-1/Drafts"     . ?d)
;;        ("/account-1/Trash"      . ?t)))
#+end_src

** Setting up Multiple Accounts
The settings below are specific to each of three different email addresses. These settings are fictional and are here for documentation purposes.
*** TODO Turn on MU4E
#+begin_src elisp
;; (defvar my-mu4e-account-alist
;;   '(("acc1-domain"
;;      (mu4e-sent-folder "/acc1-domain/Sent")
;;      (mu4e-drafts-folder "/acc1-domain/Drafts")
;;      (mu4e-trash-folder "/acc1-domain/Trash")
;;      (mu4e-compose-signature
;;        (concat
;;          "Ricky Bobby\n"
;;          "acc1@domain.com\n"))
;;      (user-mail-address "acc1@domain.com")
;;      (smtpmail-default-smtp-server "smtp.domain.com")
;;      (smtpmail-smtp-server "smtp.domain.com")
;;      (smtpmail-smtp-user "acc1@domain.com")
;;      (smtpmail-stream-type starttls)
;;      (smtpmail-smtp-service 587))
;;     ("acc2-domain"
;;      (mu4e-sent-folder "/acc2-domain/Sent")
;;      (mu4e-drafts-folder "/acc2-domain/Drafts")
;;      (mu4e-trash-folder "/acc2-domain/Trash")
;;      (mu4e-compose-signature
;;        (concat
;;          "Suzy Q\n"
;;          "acc2@domain.com\n"))
;;      (user-mail-address "acc2@domain.com")
;;      (smtpmail-default-smtp-server "smtp.domain.com")
;;      (smtpmail-smtp-server "smtp.domain.com")
;;      (smtpmail-smtp-user "acc2@domain.com")
;;      (smtpmail-stream-type starttls)
;;      (smtpmail-smtp-service 587))
;;     ("acc3-domain"
;;      (mu4e-sent-folder "/acc3-domain/Sent")
;;      (mu4e-drafts-folder "/acc3-domain/Drafts")
;;      (mu4e-trash-folder "/acc3-domain/Trash")
;;      (mu4e-compose-signature
;;        (concat
;;          "John Boy\n"
;;          "acc3@domain.com\n"))
;;      (user-mail-address "acc3@domain.com")
;;      (smtpmail-default-smtp-server "smtp.domain.com")
;;      (smtpmail-smtp-server "smtp.domain.com")
;;      (smtpmail-smtp-user "acc3@domain.com")
;;      (smtpmail-stream-type starttls)
;;      (smtpmail-smtp-service 587))))
#+end_src

** Function To Facilitate Switching Between Accounts
The following function can be used to select and account. This function then needs to be added to mu4e-compose-pre-hook.

#+begin_src elisp
;;(defun my-mu4e-set-account ()
;;  "Set the account for composing a message."
;;  (let* ((account
;;          (if mu4e-compose-parent-message
;;              (let ((maildir (mu4e-message-field mu4e-compose-parent-message :maildir)))
;;                (string-match "/\\(.*?\\)/" maildir)
;;                (match-string 1 maildir))
;;            (completing-read (format "Compose with account: (%s) "
;;                                     (mapconcat #'(lambda (var) (car var))
;;                                                my-mu4e-account-alist "/"))
;;                             (mapcar #'(lambda (var) (car var)) my-mu4e-account-alist)
;;                             nil t nil nil (caar my-mu4e-account-alist))))
;;         (account-vars (cdr (assoc account my-mu4e-account-alist))))
;;    (if account-vars
;;        (mapc #'(lambda (var)
;;                  (set (car var) (cadr var)))
;;              account-vars)
;;      (error "No email account found"))))

;;(add-hook 'mu4e-compose-pre-hook 'my-mu4e-set-account)
#+end_src

* Evaluate Elisp Expressions
Changing some keybindings from their defaults to better fit with Doom Emacs, and to avoid conflicts with my window managers which sometimes use the control key in their keybindings. By default, Doom Emacs does not use ‘SPC e’ for anything, so I choose to use the format ‘SPC e’ plus ‘key’ for these (I also use ‘SPC e’ for ‘eww’ keybindings).

#+begin_src elisp
(map! :leader
      :desc "Evaluate elisp in buffer"
      "e b" #'eval-buffer
      :leader
      :desc "Evaluate defun"
      "e d" #'eval-defun
      :leader
      :desc "Evaluate elisp expression"
      "e e" #'eval-expression
      :leader
      :desc "Evaluate last sexpression"
      "e l" #'eval-last-sexp
      :leader
      :desc "Evaluate elisp in region"
      "e r" #'eval-region)

#+end_src

* Additional Information, Useful Functions And Macros, Etc.

