.doom.d/README.org
** Registers
Emacs registers are compartments where you can save text, rectangles and positions for later use. Once you save text or a rectangle in a register, you can copy it into the buffer once or many times; once you save a position in a register, you can jump back to that position once or many times. The default GNU Emacs keybindings for these commands (with the exception of counsel-register) involves ‘C-x r’ followed by one or more other keys. I wanted to make this a little more user friendly, and since I am using Doom Emacs, I choose to replace the ‘C-x r’ part of the key chords with ‘SPC r’.

| Command                          | Description                      | Keybinding  |
| -------------------------------- | -------------------------------- | ----------- |
| copy-to-register                 | Copy to register                 | SPC r c     |
| frameset-to-register             | Frameset to register             | SPC r f     |
| insert-register                  | Insert contents of register      | SPC r i     |
| jump-to-register                 | Jump to register                 | SPC r j     |
| list-registers                   | List registers                   | SPC r l     |
| number-to-register               | Number to register               | SPC r n     |
| counsel-register                 | Interactively choose a register  | SPC r r     |
| view-register                    | View a register                  | SPC r v     |
| window-configuration-to-register | Window configuration to register | SPC r w     |
| increment-register               | Increment register               | SPC r +     |
| point-to-register                | Point to register                | SPC r SPC   |

#+begin_src elisp
(map! :leader
      :desc "Copy to register"
      "r c" #'copy-to-register
      :leader
      :desc "Frameset to register"
      "r f" #'frameset-to-register
      :leader
      :desc "Insert contents of register"
      "r i" #'insert-register
      :leader
      :desc "Jump to register"
      "r j" #'jump-to-register
      :leader
      :desc "List registers"
      "r l" #'list-registers
      :leader
      :desc "Number to register"
      "r n" #'number-to-register
      :leader
      :desc "Interactively choose a register"
      "r r" #'counsel-register
      :leader
      :desc "View a register"
      "r v" #'view-register
      :leader
      :desc "Window configuration to register"
      "r w" #'window-configuration-to-register
      :leader
      :desc "Increment register"
      "r +" #'increment-register
      :leader
      :desc "Point to register"
      "r SPC" #'point-to-register)
#+end_src

| Description      | Keybinding |
|------------------+------------+
| SSH into Lillith | SPC\d      |
| SSH into Azezel  | SPC\n      |

#+begin_src elisp

;;(map! :leader
;;      :desc "Ssh into distrotube.com"
;;      "\\ d" #'(lambda () (interactive) (find-file "/scp:derek@distrotube.com"))
;;      :leader
;;      :desc "Ssh into my nextcloud"
;;      "\\ n" #'(lambda () (interactive) (find-file "/scp:derek@distrotube.net")))
#+end_src

** Useful Functions

`load!' for loading external *.el files relative to this one
 `use-package!' for configuring packages
 `after!' for running code after a package has loaded
 `add-load-path!' for adding directories to the `load-path', relative to
 this file. Emacs searches the `load-path' when you load packages with
 `require' or `use-package'.
 `map!' for binding new keys

*** Winner Mode
Winner mode has been included with GNU Emacs since version 20. This is a global minor mode and, when activated, it allows you to “undo” (and “redo”) changes in the window configuration with the key commands ‘SCP w <left>’ and ‘SPC w <right>’.
#+begin_src elisp
(map! :leader
      :desc "Winner redo"
      "w <right>" #'winner-redo
      :leader
      :desc "Winner undo"
      "w <left>" #'winner-undo)
#+end_src
